#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/b9e509c7-ed4a-41eb-b9e9-13779b7d95e6/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "new-luis"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["new-luis"].module.budget.google_billing_budget.budget[0] will be created
  + resource "google_billing_budget" "budget" {
      + billing_account = "01710A-17EA16-57FCD3"
      + display_name    = "Budget For new-luis"
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + currency_code = (known after apply)
              + units         = "-1"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.5
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 0.7
        }
      + threshold_rules {
          + spend_basis       = "CURRENT_SPEND"
          + threshold_percent = 1
        }
    }

  # module.project-factory["new-luis"].module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = true
      + billing_account     = "01710A-17EA16-57FCD3"
      + folder_id           = "250869018475"
      + id                  = (known after apply)
      + name                = "new-luis"
      + number              = (known after apply)
      + project_id          = "new-luis"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "new-luis"
      + service                    = "compute.googleapis.com"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "new-luis"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.budget.google_billing_budget.budget[0] will be created%0A  + resource "google_billing_budget" "budget" {%0A      + billing_account = "01710A-17EA16-57FCD3"%0A      + display_name    = "Budget For new-luis"%0A      + id              = (known after apply)%0A      + name            = (known after apply)%0A%0A      + amount {%0A          + specified_amount {%0A              + currency_code = (known after apply)%0A              + units         = "-1"%0A            }%0A        }%0A%0A      + budget_filter {%0A          + credit_types           = (known after apply)%0A          + credit_types_treatment = "INCLUDE_ALL_CREDITS"%0A          + labels                 = (known after apply)%0A          + projects               = (known after apply)%0A          + services               = (known after apply)%0A          + subaccounts            = (known after apply)%0A        }%0A%0A      + threshold_rules {%0A          + spend_basis       = "CURRENT_SPEND"%0A          + threshold_percent = 0.5%0A        }%0A      + threshold_rules {%0A          + spend_basis       = "CURRENT_SPEND"%0A          + threshold_percent = 0.7%0A        }%0A      + threshold_rules {%0A          + spend_basis       = "CURRENT_SPEND"%0A          + threshold_percent = 1%0A        }%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_project.main will be created%0A  + resource "google_project" "main" {%0A      + auto_create_network = true%0A      + billing_account     = "01710A-17EA16-57FCD3"%0A      + folder_id           = "250869018475"%0A      + id                  = (known after apply)%0A      + name                = "new-luis"%0A      + number              = (known after apply)%0A      + project_id          = "new-luis"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.random_id.random_project_id_suffix will be created%0A  + resource "random_id" "random_project_id_suffix" {%0A      + b64_std     = (known after apply)%0A      + b64_url     = (known after apply)%0A      + byte_length = 2%0A      + dec         = (known after apply)%0A      + hex         = (known after apply)%0A      + id          = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.module.project_services.google_project_service.project_services["compute.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = true%0A      + id                         = (known after apply)%0A      + project                    = "new-luis"%0A      + service                    = "compute.googleapis.com"%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @luismendezescobar, Action: `pull_request`, Working Directory: `/home/runner/work/project-factory/project-factory`, Workflow: `validate code`*